# 넘파이 실습

In [52]:
import numpy as np

In [53]:
a = [1, 3.14, True, 'hello']

In [54]:
#리스트의 원소 데이터 타입 확인
print(a)
for element in a:
    print('Data type of {} : {}'.format(element, type(element)))

[1, 3.14, True, 'hello']
Data type of 1 : <class 'int'>
Data type of 3.14 : <class 'float'>
Data type of True : <class 'bool'>
Data type of hello : <class 'str'>

In [55]:
#리스트를 넘파이 배열로 넘겼을 때 원소 데이터 타입 확인
b = np.array(a)
print(b)
for elem in b :
    print('Data type of {} : {}'.format(elem,type(elem)))

['1' '3.14' 'True' 'hello']
Data type of 1 : <class 'numpy.str_'>
Data type of 3.14 : <class 'numpy.str_'>
Data type of True : <class 'numpy.str_'>
Data type of hello : <class 'numpy.str_'>

In [56]:
#중첩리스트 생성
a = [[1,2,3], [4,5,6]]
print(a)
type(a)

[[1, 2, 3], [4, 5, 6]]

list

In [57]:
#중첩리스트를 np 배열로 변환 ==> 2차원인 행렬로 변환됨
b = np.array(a)
print(b)
type(b) #np.ndarray : np가 제공하는 array 타입

[[1 2 3]
 [4 5 6]]

numpy.ndarray

In [58]:
#배열의 shape 확인
b.shape

(2, 3)

In [59]:
#배열의 차원 확인
b.ndim

2

In [60]:
#배열 size 확인(원소개수)
b.size

6

In [61]:
#2x3행렬 ->3x2행렬로 바꿔보자
print(b.reshape(3,2)) #간단하게 reshape 메소드 호출

[[1 2]
 [3 4]
 [5 6]]

In [62]:
#np 배열 요소 데이터 타입 변경 : 정수->실수
b = np.array(a,dtype=np.float64) #dtype 인수 설정 -> np가 제공하는 float으로 바꾸겠다고 명시
print(b)

[[1. 2. 3.]
 [4. 5. 6.]]

In [63]:
#np 배열 요소 데이터타입 변경 : 실수 -> 정수
b = b.astype(np.int64) # 사후 변경시 astype 메서드로 변경
print(b)

[[1 2 3]
 [4 5 6]]

## 넘파이 배열 인덱싱

In [64]:
#새로운 배열 arr 생성
arr = np.array([1,2,3,4,5])

In [65]:
print(arr)

[1 2 3 4 5]

In [66]:
#배열 첫번째 원소 가져오기
print(arr[0])

1

In [67]:
print(arr[3])

4

In [68]:
#배열의 가장 마지막 원소 가져오기
print(arr[-1])

5

### 2차원 배열 인덱싱

In [69]:
#2차원 배열 생성
arr_2d = np.array([[1,2,3] ,
                   [4,5,6]])
print(arr_2d)

[[1 2 3]
 [4 5 6]]

In [70]:
#원소 가져오기 -> arr[행,열]로 명시하여 원하는 위치의 데이터에 접근 가능
arr_2d[0,0] #1행 1열

1

In [71]:
arr_2d[1,2] #2행 3열

6

## 배열 슬라이싱

In [72]:
#슬라이싱 -> 1개이상의 연속적인 원소들에 접근할 때 사용
#arange로 연속된 숫자의 2차원 넘파이 배열 만들어보기!
arr_2d = np.arange(1,7).reshape(2,3) #1~6까지의 숫자를 저장 -> 2행 3열로 reshape(단 원소개수가 맞아야)
print(arr_2d)

[[1 2 3]
 [4 5 6]]

In [73]:
#첫번째 행 전체 출력
print(arr_2d[0,:]) #그냥 콜론 -> 전체

[1 2 3]

In [74]:
#세번째 열 전체 출력 
print(arr_2d[:,2])

[3 6]

In [75]:
#전체 행 두번째 열까지 모두 출력
print(arr_2d[:,:2])

[[1 2]
 [4 5]]

# 판다스 pandas 소개

In [76]:
import pandas as pd

## 데이터 생성

In [77]:
#실습에 사용할 샘플 data 딕셔너리 생성

data = {
    '이름' : ['김','나','박','이','신'],
    '학과' : ['국문', '수학', '영문', '과교','경영학'],
    '성적' : [3.0,1.0,3.5,2.7,4.0]
}

In [78]:
data

{'이름': ['김', '나', '박', '이', '신'],
 '학과': ['국문', '수학', '영문', '과교', '경영학'],
 '성적': [3.0, 1.0, 3.5, 2.7, 4.0]}

In [79]:
#딕셔너리 타입의 data를 dataframe화하기 -> pd.DataFrame(data)
df = pd.DataFrame(data)
display(df)

  이름   학과   성적
0  김   국문  3.0
1  나   수학  1.0
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

## 데이터 csv로 저장하기

In [80]:
# 데이터프레임을 csv로 저장 -> to_csv(저장경로와파일이름,sep=구분자,index=저장시 인덱스도 넣을것인지(t/f))
df.to_csv('./data/student.csv',sep=',',index=False)

## 데이터 불러오기

In [81]:
# 데이터 로딩 -> pd.read_csv(경로)
df=pd.read_csv('./data/student.csv')
display(df)

  이름   학과   성적
0  김   국문  3.0
1  나   수학  1.0
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

## pandas 원하는 데이터 선택하기

### 1) 슬라이싱 :  연속적인 행에 대한 데이터 선택
원하는 행들만 선택하려면 fancy indexing을 사용한다.

In [82]:
#데이터 슬라이싱 -> df[num1 : num2] -> i=num1 행부터 i=num2-1 행까지 선택
df[1:5] #index=1행 ~ 4행

  이름   학과   성적
1  나   수학  1.0
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

In [83]:
df[0:3] # 0,1,2 행 접근

  이름  학과   성적
0  김  국문  3.0
1  나  수학  1.0
2  박  영문  3.5

In [84]:
df[2:] #2번 행부터 끝까지 선택

  이름   학과   성적
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

In [85]:
df[:] #전체 선택 -> 그냥 df 라고 해도 됨

  이름   학과   성적
0  김   국문  3.0
1  나   수학  1.0
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

### 2) 인덱싱 : 열에 대한 데이터 선택

In [86]:
# 컬럼명으로 단순 인덱싱
df['이름']

0    김
1    나
2    박
3    이
4    신
Name: 이름, dtype: object

#### Fancy indexing

In [87]:
#원하는 컬럼들을 리스트로 값을 주면 됨
#이름, 학과 열에만 접근해보자
df[['이름','학과']]

  이름   학과
0  김   국문
1  나   수학
2  박   영문
3  이   과교
4  신  경영학

In [88]:
#리스트를 따로 만들어두면 더 깔끔하다.
list = ['이름','학과']
df[list] #fancy 인덱싱

  이름   학과
0  김   국문
1  나   수학
2  박   영문
3  이   과교
4  신  경영학

In [89]:
#리스트에 컬럼 입력시 순서는 중요하지 않다. 순서바뀌어도 작동함
df[['학과','이름']]

    학과 이름
0   국문  김
1   수학  나
2   영문  박
3   과교  이
4  경영학  신

#### 슬라이싱+인덱싱

In [90]:
df[1:3][['학과','이름']]

   학과 이름
1  수학  나
2  영문  박

In [91]:
df[['학과','이름']][1:3] #슬라이싱,인덱싱 순서 바뀌어도 상관 x

   학과 이름
1  수학  나
2  영문  박

#### Boolean indexing
(연산자를 이용하여 인덱싱 수행 e.g. ==, !=, >, etc)

In [92]:
#수학과 소속인 학생의 데이터만 불러오기
df[df['학과']=='수학']

  이름  학과   성적
1  나  수학  1.0

In [93]:
#성적이 3.0 이상인 학생들의 데이터만 불러오기
df[df['성적']>=3.0]

  이름   학과   성적
0  김   국문  3.0
2  박   영문  3.5
4  신  경영학  4.0

과정)
1. df['성적']>=3.0 인 명령어 입력
2. boolean값(True/False)이 출력됨  
김 True  
나 False  
박 True  
이 False  
신 True  

3. 즉. df[df['성적']>=3.0] -> df[ [True, False, ... ,True] ] 이렇게 해석됨
4. True인 행에 관한 모든 정보에 접근

In [94]:
# 성적이 0.5로 나누어 떨어지는 행에 접근
df[df['성적']%0.5==0]

  이름   학과   성적
0  김   국문  3.0
1  나   수학  1.0
2  박   영문  3.5
4  신  경영학  4.0

In [95]:
df['성적']%0.5==0

0     True
1     True
2     True
3    False
4     True
Name: 성적, dtype: bool

### pandas 고급 인덱싱 loc & iloc 인덱서

In [96]:
# 한 개의 행에 대해서만 loc indexing
df.loc[3] # index = 3인 행의 모든 정보를 가져옴

이름      이
학과     과교
성적    2.7
Name: 3, dtype: object

In [97]:
df

  이름   학과   성적
0  김   국문  3.0
1  나   수학  1.0
2  박   영문  3.5
3  이   과교  2.7
4  신  경영학  4.0

여러개의 행을 Fancy indexing을 통해 불러와보자.

In [98]:
#행에 대한 fancy indexing
df.loc[[1,3,4]] #loc인덱서에 리스트로 값을 부여

  이름   학과   성적
1  나   수학  1.0
3  이   과교  2.7
4  신  경영학  4.0

In [99]:
# 인덱서를 ','로 구분하면 열에 대한 인덱싱도 가능

# 행에 대한 fancy 인덱싱과 컬럼 슬라이싱
df.loc[[1,3,4],'이름':'성적']

  이름   학과   성적
1  나   수학  1.0
3  이   과교  2.7
4  신  경영학  4.0

In [100]:
# 행에 대한 fancy indexing과 열에 대한 fancy indexing
df.loc[[1,3,4],['이름','성적']]

  이름   성적
1  나  1.0
3  이  2.7
4  신  4.0

In [101]:
# iloc인덱서(컬럼번호 명시) 사용
df.iloc[[1,3,4],0:2] #컬럼번호 2은 포함하지 않는다

  이름   학과
1  나   수학
3  이   과교
4  신  경영학

In [102]:
# loc + boolean indexing
# 성적이 2로 나누어지지 않는 행들의 이름, 성적을 가져와라
df.loc[df['성적']%2!=0,['이름','성적']]

  이름   성적
0  김  3.0
1  나  1.0
2  박  3.5
3  이  2.7